07/app/views/theses/_form.html.erb

SELECT "faculties".* FROM "faculties"
---
    <%= f.label :faculty %><br>
    <%= f.select :faculty_id, Faculty.all.collect { |f| [f.name, f.id] }, include_blank: true %>

SELECT "authors".* FROM "authors"
---
    <%= f.label :author %><br>
    <%= f.select :author_id, Author.all.collect { |a| [a.surname, a.id] }, include_blank: true %>