07/app/controllers/authors_controller.rb

INSERT INTO "authors" ("username", "firstname", "surname", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["username", "Martin"], ["firstname", "Solveig"], ["surname", "SolveigBro"], ["created_at", 2016-12-27 00:27:33 UTC], ["updated_at", 2016-12-27 00:27:33 UTC]]
---
  def create
    @author = Author.new(author_params)

    respond_to do |format|
      if @author.save